# CorrectionFactorSetIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CorrectionFactorSetIterator Class
Members See Also
---
An iterator to a correction factor set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class CorrectionFactorSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class CorrectionFactorSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class CorrectionFactorSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..CorrectionFactorSetIterator
# See Also
CorrectionFactorSetIterator Members
Autodesk.Revit.DB.Electrical Namespace